In [1]:
import pandas as pd  # importación de pandas 
import numpy as np  # importacion de numpy 

pd.set_option('display.max_columns', None)  # mostrar todas las columnas del df 
pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

import warnings  # importacion de bloqueo de errores
warnings.filterwarnings('ignore')

import pylab as plt    # visualización
import seaborn as sns    # visualización

%matplotlib inline

### LIMPIEZA  TABLA ACTORS

In [2]:
data_actors = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\actor.csv',encoding='latin1')

In [3]:
data_actors.shape

(200, 4)

In [4]:
data_actors.head(20)

    actor_id first_name     last_name          last_update
0          1   PENELOPE       GUINESS  2006-02-15 04:34:33
1          2       NICK      WAHLBERG  2006-02-15 04:34:33
2          3         ED         CHASE  2006-02-15 04:34:33
3          4   JENNIFER         DAVIS  2006-02-15 04:34:33
4          5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
5          6      BETTE     NICHOLSON  2006-02-15 04:34:33
6          7      GRACE        MOSTEL  2006-02-15 04:34:33
7          8    MATTHEW     JOHANSSON  2006-02-15 04:34:33
8          9        JOE         SWANK  2006-02-15 04:34:33
9         10  CHRISTIAN         GABLE  2006-02-15 04:34:33
10        11       ZERO          CAGE  2006-02-15 04:34:33
11        12       KARL         BERRY  2006-02-15 04:34:33
12        13        UMA          WOOD  2006-02-15 04:34:33
13        14     VIVIEN        BERGEN  2006-02-15 04:34:33
14        15       CUBA       OLIVIER  2006-02-15 04:34:33
15        16       FRED       COSTNER  2006-02-15 04:34:33
16        17      HELEN        VOIGHT  2006-02-15 04:34:33
17        18        DAN          TORN  2006-02-15 04:34:33
18        19        BOB       FAWCETT  2006-02-15 04:34:33
19        20    LUCILLE         TRACY  2006-02-15 04:34:33

In [5]:
data_actors.drop(columns='last_update', inplace = True)

In [6]:
data_actors.shape

(200, 3)

In [7]:
data_actors.head(10)

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA
5         6      BETTE     NICHOLSON
6         7      GRACE        MOSTEL
7         8    MATTHEW     JOHANSSON
8         9        JOE         SWANK
9        10  CHRISTIAN         GABLE

In [8]:
data_actors.first_name.value_counts()

PENELOPE       4
JULIA          4
KENNETH        4
GENE           3
GROUCHO        3
DAN            3
CUBA           3
JAYNE          3
CAMERON        3
FAY            3
CHRISTIAN      3
MATTHEW        3
BURT           3
MORGAN         3
RUSSELL        3
ED             3
NICK           3
MENA           2
ANGELA         2
MARY           2
GARY           2
ADAM           2
SEAN           2
CATE           2
GRETA          2
SCARLETT       2
BEN            2
REESE          2
MINNIE         2
ALBERT         2
SPENCER        2
CHRISTOPHER    2
DARYL          2
CHRIS          2
RENEE          2
SUSAN          2
MERYL          2
FRANCES        2
WARREN         2
AUDREY         2
KEVIN          2
LUCILLE        2
MICHAEL        2
RIP            2
WOODY          2
VIVIEN         2
MILLA          2
KIRSTEN        2
SANDRA         2
HUMPHREY       2
TOM            2
JOHNNY         2
LIZA           1
DEBBIE         1
ROCK           1
GREGORY        1
SALMA          1
LISA           1
JULIANNE       1
JON            1
WILLIAM        1
JOHN           1
HARRISON       1
BELA           1
JEFF           1
HARVEY         1
ALAN           1
RIVER          1
OPRAH          1
IAN            1
SYLVESTER      1
GEOFFREY       1
EMILY          1
AL             1
KIM            1
JADA           1
JANE           1
WHOOPI         1
LAURENCE       1
WILL           1
EWAN           1
OLYMPIA        1
RITA           1
LAURA          1
RICHARD        1
MAE            1
GINA           1
BOB            1
JODIE          1
GOLDIE         1
VAL            1
JUDY           1
TIM            1
SISSY          1
ALEC           1
ELVIS          1
HELEN          1
SIDNEY         1
FRED           1
UMA            1
KARL           1
ZERO           1
JOE            1
GRACE          1
BETTE          1
JENNIFER       1
KIRK           1
PARKER         1
ANNE           1
NATALIE        1
WALTER         1
JIM            1
MEG            1
ELLEN          1
CHARLIZE       1
GREG           1
JAMES          1
RALPH          1
CARY           1
ANGELINA       1
MICHELLE       1
JESSICA        1
RAY            1
HENRY          1
DUSTIN         1
JUDE           1
CARMEN         1
THORA          1
Name: first_name, dtype: int64

In [9]:
data_nombre_completo = data_actors.last_name.str.cat(data_actors.first_name, sep=', ')

In [10]:
data_nombre_completo.value_counts()

DAVIS, SUSAN             2
GOODING, EWAN            1
CRAWFORD, DARYL          1
KEITEL, GRETA            1
JACKMAN, JANE            1
HOPPER, ADAM             1
PENN, RICHARD            1
HOPKINS, GENE            1
REYNOLDS, RITA           1
MANSFIELD, ED            1
WILLIAMS, MORGAN         1
DEE, LUCILLE             1
HURT, WHOOPI             1
HESTON, GEOFFREY         1
HARRIS, CATE             1
RYDER, JADA              1
DEAN, RIVER              1
WITHERSPOON, ANGELA      1
ALLEN, KIM               1
JOHANSSON, ALBERT        1
WINSLET, FAY             1
DEE, EMILY               1
TEMPLE, RUSSELL          1
NOLTE, JAYNE             1
MCQUEEN, CATE            1
GUINESS, PENELOPE        1
TOMEI, FRANCES           1
NOLTE, ALBERT            1
LEIGH, MATTHEW           1
CRONYN, PENELOPE         1
CROWE, SIDNEY            1
DUNST, GROUCHO           1
DEGENERES, GINA          1
NOLTE, WARREN            1
DERN, SYLVESTER          1
ZELLWEGER, CAMERON       1
BACALL, RUSSELL          1
HOPKINS, MORGAN          1
MCDORMAND, MORGAN        1
BALE, HARRISON           1
STREEP, DAN              1
TRACY, RENEE             1
ALLEN, CUBA              1
JACKMAN, WARREN          1
MONROE, PENELOPE         1
BERGMAN, LIZA            1
NOLTE, SALMA             1
DENCH, JULIANNE          1
BENING, SCARLETT         1
GARLAND, KEVIN           1
HARRIS, BEN              1
KILMER, MINNIE           1
GIBSON, MERYL            1
GUINESS, ED              1
SILVERSTONE, JEFF        1
CARREY, MATTHEW          1
AKROYD, DEBBIE           1
CLOSE, RUSSELL           1
GARLAND, HUMPHREY        1
BOLGER, MICHAEL          1
ZELLWEGER, JULIA         1
BALL, RENEE              1
DUKAKIS, ROCK            1
BIRCH, CUBA              1
BAILEY, AUDREY           1
GOODING, GREGORY         1
SUVARI, JOHN             1
TEMPLE, BURT             1
ALLEN, MERYL             1
SILVERSTONE, JAYNE       1
WALKEN, BELA             1
WEST, REESE              1
KEITEL, MARY             1
FAWCETT, JULIA           1
MONROE, LISA             1
MCKELLEN, GENE           1
CHASE, JON               1
WILLIS, HUMPHREY         1
TANDY, IAN               1
WOOD, FAY                1
MALDEN, GRETA            1
BASINGER, VIVIEN         1
BRODY, LAURA             1
DEPP, CHRIS              1
HOPE, HARVEY             1
KILMER, OPRAH            1
WEST, CHRISTOPHER        1
GARLAND, AL              1
HACKMAN, WILLIAM         1
DEGENERES, NICK          1
BULLOCK, LAURENCE        1
WILSON, WILL             1
HOFFMAN, KENNETH         1
HOPPER, MENA             1
PFEIFFER, OLYMPIA        1
WILLIAMS, GROUCHO        1
DREYFUSS, ALAN           1
BENING, MICHAEL          1
TORN, WALTER             1
DEPP, SPENCER            1
WAHLBERG, NICK           1
CRAWFORD, RIP            1
HOFFMAN, WOODY           1
WAYNE, ALEC              1
PECK, SANDRA             1
SOBIESKI, SISSY          1
HACKMAN, TIM             1
PECK, MILLA              1
OLIVIER, AUDREY          1
DEAN, JUDY               1
DUKAKIS, BURT            1
BOLGER, VAL              1
MCKELLEN, TOM            1
BRODY, GOLDIE            1
CAGE, JOHNNY             1
DEGENERES, JODIE         1
MIRANDA, TOM             1
JOVOVICH, KIRK           1
STALLONE, NICK           1
KILMER, REESE            1
GOLDBERG, PARKER         1
BARRYMORE, JULIA         1
DAY-LEWIS, FRANCES       1
MCQUEEN, JULIA           1
BLOOM, KEVIN             1
HOPKINS, NATALIE         1
STREEP, CAMERON          1
CHASE, ED                1
DAVIS, JENNIFER          1
LOLLOBRIGIDA, JOHNNY     1
NICHOLSON, BETTE         1
MOSTEL, GRACE            1
JOHANSSON, MATTHEW       1
SWANK, JOE               1
GABLE, CHRISTIAN         1
CAGE, ZERO               1
BERRY, KARL              1
WOOD, UMA                1
BERGEN, VIVIEN           1
OLIVIER, CUBA            1
COSTNER, FRED            1
VOIGHT, HELEN            1
TORN, DAN                1
FAWCETT, BOB             1
TRACY, LUCILLE           1
PALTROW, KIRSTEN         1
MARX, ELVIS              1
KILMER, SANDRA           1
CRONYN, ANNE             1
PHOENIX, GARY            1
MOSTEL, JIM              1
ASTAIRE, ANGELINA        1
SINATRA, GROUCHO         1
HOFFMAN, MAE             1
CRUZ, RALPH              1
DAMON, SCARLETT          1
JOLIE, WOODY             1
WILLIS, BEN              1
PITT, JAMES              1
ZELLWEGER, MINNIE        1
CHAPLIN, GREG            1
PECK, SPENCER            1
PESCI, KENNETH           1
DENCH, CHARLIZE          1
GUINESS, SEAN            1
BERRY, CHRISTOPHER       1
AKROYD, KIRSTEN          1
PRESLEY, ELLEN           1
TORN, KENNETH            1
WAHLBERG, DARYL          1
WILLIS, GENE             1
HAWKE, MEG               1
BRIDGES, CHRIS           1
MCCONAUGHEY, CARY        1
POSEY, BURT              1
HUNT, CARMEN             1
KEITEL, MILLA            1
TEMPLE, MENA             1
PINKETT, PENELOPE        1
KILMER, FAY              1
HARRIS, DAN              1
CRUISE, JUDE             1
AKROYD, CHRISTIAN        1
TAUTOU, DUSTIN           1
BERRY, HENRY             1
NEESON, CHRISTIAN        1
NEESON, JAYNE            1
WRAY, CAMERON            1
JOHANSSON, RAY           1
HUDSON, ANGELA           1
TANDY, MARY              1
BAILEY, JESSICA          1
WINSLET, RIP             1
PALTROW, KENNETH         1
MCCONAUGHEY, MICHELLE    1
GRANT, ADAM              1
WILLIAMS, SEAN           1
PENN, GARY               1
TEMPLE, THORA            1
Name: last_name, dtype: int64

In [11]:
data_actors.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

###  LIMPIEZA TABLA CATEGORY

In [12]:
data_category = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\category.csv',encoding='latin1')

In [13]:
data_category

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [14]:
data_category.shape

(16, 3)

In [15]:
data_category.drop(columns='last_update', inplace = True)

In [16]:
data_category.shape

(16, 2)

In [17]:
data_category.drop_duplicates().shape==data_category.shape

True

### LIMPIEZA TABLA FILM

In [18]:
data_film = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\film.csv',encoding='latin1')

In [19]:
data_film.shape

(1000, 13)

In [20]:
data_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

### ¿cuantos y donde estan los valores nulos?

In [21]:
nan_cols = data_film.isna().sum()
nan_cols[nan_cols>0]

original_language_id    1000
dtype: int64

###  Sustituimos Nan por unknown

In [22]:
data_film.original_language_id.fillna('unknown',inplace = True)

### Que valores unicos a hay en la columna original_lenguaje_id

In [23]:
data_film.original_language_id.unique()

array(['unknown'], dtype=object)

### ¿ CUANTOS valores/objetos/elementos hay en esa columna?

In [24]:
data_film.original_language_id.value_counts()

unknown    1000
Name: original_language_id, dtype: int64

In [25]:
data_film.head(5)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,unknown,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,unknown,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,unknown,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,unknown,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,unknown,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [26]:
data_film.drop(columns='last_update', inplace = True)

In [27]:
data_film.shape

(1000, 12)

In [28]:
data_film.drop(columns='original_language_id', inplace = True)

In [29]:
data_film.shape

(1000, 11)

In [30]:
data_film.drop(columns='release_year', inplace = True)

In [31]:
data_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

### LIMPIEZA TABLA LANGUAGE

In [32]:
data_language = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\language.csv',encoding='latin1')

In [33]:
data_language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [34]:
data_language.drop(columns='last_update', inplace = True)

In [35]:
data_language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

### LIMPIEZA TABLA INVENTORY

In [36]:
data_inventory = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\inventory.csv',encoding='latin1')

In [37]:
data_inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [38]:
data_inventory.drop(columns='last_update', inplace = True)

In [39]:
data_inventory.shape

(1000, 3)

In [40]:
data_inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [41]:
data_inventory.drop_duplicates(['inventory_id','film_id','store_id']).shape==data_inventory.shape

True

### LIMPIEZA RENTAL

In [42]:
data_rent = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\rental.csv',encoding='latin1')

In [43]:
data_rent.shape

(1000, 7)

In [44]:
data_rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [45]:
data_rent.drop(columns='last_update', inplace = True)

In [46]:
data_rent.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [47]:
new_cols=['rental_id', 'rental_date','return_date','inventory_id', 'customer_id','staff_id']

In [48]:
data_rent= data_rent[new_cols]

In [49]:
data_rent.head()

,rental_id,rental_date,return_date,inventory_id,customer_id,staff_id
0,1,2005-05-24 22:53:30,2005-05-26 22:04:30,367,130,1
1,2,2005-05-24 22:54:33,2005-05-28 19:40:33,1525,459,1
2,3,2005-05-24 23:03:39,2005-06-01 22:12:39,1711,408,1
3,4,2005-05-24 23:04:41,2005-06-03 01:43:41,2452,333,2
4,5,2005-05-24 23:05:21,2005-06-02 04:33:21,2079,222,1

###  LIMPIEZA TABLA HDD

In [50]:
data_hdd = pd.read_csv(r'C:\Users\pablo\w3-database-project\data\old_HDD.csv',encoding='latin1')

In [51]:
data_hdd.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [52]:
actor_id = []

data_hdd.loc[0]['first_name']

for i in range(len(data_hdd)):
    
    for j in range(len(data_actors)):
        
        if data_hdd.loc[i]['first_name'] == data_actors.loc[j]['first_name'] and data_hdd.loc[i]['last_name'] == data_actors.loc[j]['last_name']:
            
            actor_id.append(data_actors.loc[j]['actor_id'])
            
            break

In [53]:
data_hdd['actor_id'] = actor_id

In [54]:
data_hdd.head()

,first_name,last_name,title,release_year,category_id,actor_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,1
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,1
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,1
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,1

In [55]:
film_id = []

data_hdd.loc[0]['title']

for i in range(len(data_hdd)):
    
    for j in range(len(data_film)):
        
        if data_hdd.loc[i]['title'] == data_film.loc[j]['title']: 
        
            film_id.append(data_film.loc[j]['film_id'])
            
            break

In [56]:
data_hdd['film_id'] = film_id

In [57]:
data_hdd.head()

,first_name,last_name,title,release_year,category_id,actor_id,film_id
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,1,1
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,1,23
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,1,25
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,1,106
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,1,140

In [58]:
data_hdd.columns

Index(['first_name', 'last_name', 'title', 'release_year', 'category_id',
       'actor_id', 'film_id'],
      dtype='object')

In [59]:
new_cols2 = ['actor_id','film_id','category_id','first_name', 'last_name', 'title', 'release_year']

In [60]:
data_hdd=data_hdd[new_cols2]

In [61]:
data_hdd.head()

,actor_id,film_id,category_id,first_name,last_name,title,release_year
0,1,1,6,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006
1,1,23,2,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006
2,1,25,13,PENELOPE,GUINESS,ANGELS LIFE,2006
3,1,106,10,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006
4,1,140,14,PENELOPE,GUINESS,CHEAPER CLYDE,2006

### PYTHON - SQL

In [62]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\pablo\anaconda3\lib\site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\pablo\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)
Note: you may need to restart the kernel to use updated packages.

In [63]:
import mysql.connector as conn

In [64]:
conexion=conn.connect(host='localhost', user='root', passwd='aaaa') # conexion al servidor

cursor=conexion.cursor()

cursor.execute('drop database if exists videoclub;')

cursor.execute('create database videoclub1;')

### Alchemy

In [65]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\pablo\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\pablo\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [66]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\pablo\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [67]:

from sqlalchemy import create_engine

In [68]:
str_conn='mysql+pymysql://root:aaaa@localhost:3306'

cursor=create_engine(str_conn)

In [69]:
cursor.execute('drop database if exists videoclub1;')

cursor.execute('create database videoclub;')

###  IMPORTANTE REFERENCIAR LA CONEXION A LA BASE DATOS QUE VAMOS A MODIFICAR

In [70]:
str_conn='mysql+pymysql://root:aaaa@localhost:3306/videoclub'  #<<< IMPORTANTE 3306/VIDEOCLUB

cursor=create_engine(str_conn)

In [71]:
data_actors.to_sql(name='actor', con=cursor, if_exists='replace', index=False)

200

In [72]:
data_category.to_sql(name='category', con=cursor, if_exists='replace', index=False)

16

In [73]:
data_film.to_sql(name='film', con=cursor, if_exists='replace', index=False)

1000

In [74]:
data_inventory.to_sql(name='inventory', con=cursor, if_exists='replace', index=False)

1000

In [75]:
data_language.to_sql(name='language', con=cursor, if_exists='replace', index=False)

6

In [76]:
data_hdd.to_sql(name='old_hdd', con=cursor, if_exists='replace', index=False)

1000

In [77]:
data_rent.to_sql(name='rental', con=cursor, if_exists='replace', index=False)

1000

### queries

In [1]:
query ='''

select track_name, user_rating, prime_genre

        from ratings
          
        where price=0 and user_rating>4;


'''


datos=pd.read_sql(query, cursor)

datos.head()

NameError: name 'pd' is not defined